import java.util.Scanner;

/**
 * 6. Создать класс.
 * В методе main получить введенное с консоли слово и вывести на консоль выражение:
 * введенное слово "и_тут_в_кавычках_должно_быть_введенное_слово".
 */
public class Task6 {
    /**
     * Main method that prints the first word from console
     */
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println(scanner.next());
    }
}

